//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ 
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ПолучитьФункциональнуюОпцию("УчетПоСкладам") Тогда

		// Установка параметра Склад динамического списка.
		Если Параметры.Свойство("ОстаткиПоСкладу") Тогда

			СправочникСписок.Параметры.УстановитьЗначениеПараметра("ПоВсемСкладам", Ложь);
			СправочникСписок.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.ОстаткиПоСкладу); 

		Иначе

			Отказ = Истина; 

		КонецЕсли

	Иначе

		СправочникСписок.Параметры.УстановитьЗначениеПараметра("ПоВсемСкладам", Истина);
		СправочникСписок.Параметры.УстановитьЗначениеПараметра("Склад", Справочники.Склады.ПустаяСсылка()); 

	КонецЕсли;
	Стр = Новый Структура("Данные", 1 );
	Тест(Стр);
КонецПроцедуры



// Проверяет работу
// 
// Параметры:
// 	Параметры - Структура - Данные для проверки
Процедура Тест(Параметры)
	Если (Параметры.Свойство("Данные")) Тогда
		
	КонецЕсли;
КонецПроцедуры


// Обработчик команды
// 
// Параметры:
// 	Команда - КомандаФормы - Описание
&НаКлиенте
Процедура  Тест1(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

